# 1 Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# # Пример:
# # - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# list = [2, 3, 5, 9, 3]
# sum = 0
# i = 0

# while i < len(list):
#     if i % 2 != 0:
#         sum += list[i]
#         i +=1
#     else:
#         i +=1
# print(sum)

# 2 Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# # - [2, 3, 4, 5, 6] => [12, 15, 16];
# # - [2, 3, 5, 6] => [12, 15]

# list = [2, 3, 4, 5, 6]
# multi = 1
# i = 0
# back = len(list)-1

# while i < len(list)/2:
#     multi = list[i]*list[back] 
#     print(multi, end=" ")
#     i +=1
#     back = back - 1

# # 3 Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# # Пример:

# # - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# list = [1.1, 1.2, 3.1, 5.0, 10.01]

# min = 1 
# max = 0

# for i in list:
#     if (i - int(i)) <= min:
#         min = i - int(i)
#     if (i - int(i)) >= max:
#         max = i - int(i)  
# print(round(max-min, 2))

# 4 Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# # Пример:

# # - 45 -> 101101
# # - 3 -> 11
# # - 2 -> 10

# a = int(input('Введите число: '))
 
# b = ''
 
# while a > 0:
#     b = str(a % 2) + b
#     a = a // 2
 
# print(f'Введенное число в двоичной системе равно {b}')

# 5 Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

k = int(input('Введите число k: '))

def Fibonacci(n):
    if n in [1, 2]:                       
        return 1
    else:
        return Fibonacci(n-1) + Fibonacci(n-2)

def NegaFibonacci(n):
    if n == 1:                       
        return 1
    elif n == 2:                       
        return -1
    else:
        num1, num2 = 1, -1
        for i in range(2, n):
            num1, num2 = num2, num1 - num2
        return num2

list = [0]
for e in range(1, k + 1):
    list.append(Fibonacci(e))
    list.insert(0, NegaFibonacci(e))
print(list)