# # 1 Напишите программу, удаляющую из текста все слова, содержащие заданную строку. Пример - "Пугать ты галок пугай => заданная строка "пугай" => Пугать ты галок".

# text = 'Пугать ты галок пугай'

# def del_words(text):
#     text = list(filter(lambda a: 'пугай' not in a, text.split()))
#     return " ".join(text)

# text = del_words(text)
# print(text)

